[
  {"degrees": "1°-5°", "angel_number": 1, "angel": "VEHUIAH", "meaning": "Will and New Beginnings", "purpose": "Subtle spirit. Endowed with great wisdom, enthusiastic for science and the arts, capable of undertaking and accomplishing the most difficult things."},
  {"degrees": "6°-10°", "angel_number": 2, "angel": "JELIEL", "meaning": "Love and Wisdom", "purpose": "To quell popular uprisings. To obtain victory over those who attack unjustly. Sprightly spirit, agreeable and courteous manners, passionate for sex."},
  {"degrees": "11°-15°", "angel_number": 3, "angel": "SITAEL", "meaning": "Construction of the Universe/Worlds", "purpose": "Against adversities. Protects against weapons and wild beasts. Loves truth, will keep his word, will oblige those in need of his services."},
  {"degrees": "16°-20°", "angel_number": 4, "angel": "ELEMIAH", "meaning": "Divine Power", "purpose": "Against mental troubles and for the identification of traitors. Governs voyages, sea travels. Industrious, successful, keen for travel."},
  {"degrees": "21°-25°", "angel_number": 5, "angel": "MAHASIAH", "meaning": "Rectification", "purpose": "To live in peace with everyone. Governs high science, occult philosophy, theology, the liberal arts. Learns easily, keen for honest pleasures."},
  {"degrees": "26°-30°", "angel_number": 6, "angel": "LELAHEL", "meaning": "Light of Understanding", "purpose": "To acquire knowledge and cure disease. Governs love, renown, science, arts and fortune. Features (include) ambition, fame."},
  {"degrees": "31°-35°", "angel_number": 7, "angel": "ACHAIAH", "meaning": "Patience", "purpose": "Governs patience, secrets of nature. Loves learning, proud to accomplish the most difficult tasks."},
  {"degrees": "36°-40°", "angel_number": 8, "angel": "CAHETEL", "meaning": "Divine Blessings", "purpose": "To obtain the benediction of God and to drive away evil spirits. Governs agricultural production. Inspires man to rise towards God."},
  {"degrees": "41°-45°", "angel_number": 9, "angel": "HAZIEL", "meaning": "Divine Mercy and Forgiveness", "purpose": "Mercy of God, friendship and favor of the great, execution of a promise made. Governs good faith and reconciliation. Sincere in promises, will easily extend pardon."},
  {"degrees": "46°-50°", "angel_number": 10, "angel": "ALADIAH", "meaning": "Divine Grace", "purpose": "Good for those guilty of hidden crimes and fearing discovery. Governs rage and pestilence, cure of disease. Good health, successful in his undertakings."},
  {"degrees": "51°-55°", "angel_number": 11, "angel": "LAUVIAH", "meaning": "Victory", "purpose": "Against lightning and for the obtainment of victory. Governs renown. Great personage, learned, celebrated for personal talents."},
  {"degrees": "56°-60°", "angel_number": 12, "angel": "HAHAIAH", "meaning": "Refuge, Shelter", "purpose": "Against adversity. Governs dreams. Mysteries hidden from mortals. Gentle, witty, discreet manners."},
  {"degrees": "61°-65°", "angel_number": 13, "angel": "YEZALEL", "meaning": "Fidelity, Loyalty and Allegiance", "purpose": "Governs friendship, reconciliation, conjugal fidelity. Learns easily. Adroit."},
  {"degrees": "66°-70°", "angel_number": 14, "angel": "MEBAHEL", "meaning": "Truth, Liberty and Justice", "purpose": "Against those who seek to usurp the fortunes of others. Governs justice, truth, liberty. Delivers the oppressed and protects prisoners. Loves jurisprudence, affinity for law courts."},
  {"degrees": "71°-75°", "angel_number": 15, "angel": "HARIEL", "meaning": "Purification", "purpose": "Against the impious. Governs sciences and arts. Religious sentiments, morally pure."},
  {"degrees": "76°-80°", "angel_number": 16, "angel": "HAKAMIAH", "meaning": "Loyalty", "purpose": "Against traitors and for deliverance from those who seek to oppress us. Govern crowned heads, great captains. Gives victory. Frank, loyal, brave character, sensitive to points of honor, an affinity for Venus."},
  {"degrees": "81°-85°", "angel_number": 17, "angel": "LAVIAH", "meaning": "Revelation", "purpose": "To be invoked while fasting. Against mental anguish, sadness. Governs high sciences, marvelous discoveries. Gives revelations in dreams. Loves music, poetry, literature and philosophy."},
  {"degrees": "86°-90°", "angel_number": 18, "angel": "CALIEL", "meaning": "Justice", "purpose": "To obtain prompt aid. Makes truth known in law suits, causes innocence to triumph. Just, honest, loves truth, judiciary."},
  {"degrees": "91°-95°", "angel_number": 19, "angel": "LEUVIAH", "meaning": "Expansive Intelligence/Fruition", "purpose": "To be invoked while facing South. To obtain the grace of God. Governs memory, human intelligence. Amiable, lively, modest, bearing of adversity with resignation."},
  {"degrees": "96°-100°", "angel_number": 20, "angel": "PAHALIAH", "meaning": "Redemption", "purpose": "Against enemies of religion, for the conversion of nations to Christianity. Governs religion, theology, morality, chastity, purity. Ecclesiastical vocation."},
  {"degrees": "101°-105°", "angel_number": 21, "angel": "NELCHAEL", "meaning": "Ardent Desire to Learn", "purpose": "Against calumniators and spells and for the destruction of evil spirits. Governs astronomy, mathematics, geography and all abstract sciences. Loves poetry, literature, avid for study."},
  {"degrees": "106°-110°", "angel_number": 22, "angel": "YEIAYEL", "meaning": "Fame, Renown", "purpose": "Governs fortune, renown, diplomacy, commerce, influence on voyages, discoveries, protection against storms and shipwreck. Loves business, industriousness, liberal and philanthropic ideas."},
  {"degrees": "111°-115°", "angel_number": 23, "angel": "MELAHEL", "meaning": "Healing Capacity", "purpose": "Against weapons and for safety in travel. Governs water, produce of the earth, and especially plants necessary for the cure of disease. Courageous, accomplishes honorable actions."},
  {"degrees": "116°-120°", "angel_number": 24, "angel": "HAHEUIAH", "meaning": "Protection", "purpose": "To obtain the grace and mercy of God. Governs exiles, fugitives, defaulters. Protects against harmful animals. Preserves from thieves and assassins. Loves truth, the exact sciences, sincere in word and deed."},
  {"degrees": "121°-125°", "angel_number": 25, "angel": "NITH-HAIAH", "meaning": "Spiritual Wisdom and Magic", "purpose": "For the acquisition of wisdom and the discovery of the truth of hidden mysteries. Governs occult sciences. Gives revelations in dreams, particularly to those born on the day over which he presides influences those who practice the magic of the sages."},
  {"degrees": "126°-130°", "angel_number": 26, "angel": "HAAIAH", "meaning": "Political Science and Ambition", "purpose": "For the winning of a law suit. Protects those who search after truth. Influences politics, diplomats, secret expeditions and agents."},
  {"degrees": "131°-135°", "angel_number": 27, "angel": "YERATEL", "meaning": "Propagation of Light", "purpose": "To confound wrong-doers and liars and for deliverance from one's enemies. Governs propagation of light, civilization. Love peace, justice, science and arts; special affinity for literature."},
  {"degrees": "136°-140°", "angel_number": 28, "angel": "SEHEIAH", "meaning": "Longevity", "purpose": "Against infirmities and thunder, protects against fire, the ruin of buildings, falls and illnesses. Governs health, simplicity. Has much judgment."},
  {"degrees": "141°-145°", "angel_number": 29, "angel": "REIYEL", "meaning": "Liberation", "purpose": "Against the impious and enemies of religion; for deliverance from all enemies both visible and invisible. Virtue and zeal for the propagation of truth, will do his utmost to destroy impiety."},
  {"degrees": "146°-150°", "angel_number": 30, "angel": "OMAEL", "meaning": "Fertility, Multiplicity", "purpose": "Against sorrow, despair and for the acquisition of patience. Governs animal kingdom, watches over the generation of beings. Chemists, doctors, surgeons. Affinity for anatomy and medicine."},
  {"degrees": "151°-155°", "angel_number": 31, "angel": "LECABEL", "meaning": "Intellectual Talent", "purpose": "For the acquisition of knowledge. Governs vegetation and agriculture. Loves astronomy, mathematics and geometry."},
  {"degrees": "156°-160°", "angel_number": 32, "angel": "VASARIAH", "meaning": "Clemency and Equilibrium", "purpose": "Against those who attack us in court. Governs justice. Good memory, articulate."},
  {"degrees": "161°-165°", "angel_number": 33, "angel": "YEHUIAH", "meaning": "Subordination to Higher Order", "purpose": "To be invoked while fasting. Against mental anguish, sadness. Governs high sciences, marvelous discoveries. Gives revelations in dreams. Loves music, poetry, literature and philosophy."},
  {"degrees": "166°-170°", "angel_number": 34, "angel": "LEHAHIAH", "meaning": "Obedience", "purpose": "To obtain the grace and mercy of God. Governs exiles, fugitives, defaulters. Protects against harmful animals. Preserves from thieves and assassins. Loves truth, the exact sciences, sincere in word and deed."},
  {"degrees": "171°-175°", "angel_number": 35, "angel": "CHEVAKIAH", "meaning": "Reconciliation", "purpose": "For the identification of traitors."},
  {"degrees": "176°-180°", "angel_number": 36, "angel": "MENADEL", "meaning": "Inner/Outer Work", "purpose": "Against anger. Known for his talents and acts, the confidence and fervor of his prayers."},
  {"degrees": "181°-185°", "angel_number": 37, "angel": "ANIEL", "meaning": "Breaking the Circle", "purpose": "To obtain victory and stop the siege of a city. Governs sciences and arts. Reveals the secrets of nature, inspires philosophers, sages. Distinguished savant."},
  {"degrees": "186°-190°", "angel_number": 38, "angel": "HAAMIAH", "meaning": "Ritual and Ceremony", "purpose": "For the acquisition of all the treasures of heaven and earth. Against fraud, weapons, wild beasts and infernal spirits. Governs all that relates to God."},
  {"degrees": "191°-195°", "angel_number": 39, "angel": "REHAEL", "meaning": "Filial Submission", "purpose": "For the healing of the sick. Governs health and longevity. Influences paternal and filial affection."},
  {"degrees": "196°-200°", "angel_number": 40, "angel": "YEIAZEL", "meaning": "Divine Consolation and Comfort", "purpose": "For the deliverance of prisoners, for consolation, for deliverance from one's enemies. Governs printing and books. Men of letters and artists."},
  {"degrees": "201°-205°", "angel_number": 41, "angel": "HAHAHEL", "meaning": "Mission", "purpose": "Against the impious, slanderers. Governs Christianity. Greatness of soul, energy. Consecrated to the service of God."},
  {"degrees": "206°-210°", "angel_number": 42, "angel": "MIKHAEL", "meaning": "Political Authority and Order", "purpose": "For safety in travel. For the discovery of conspiracies. Concerned with political affairs, diplomatic."},
  {"degrees": "211°-215°", "angel_number": 43, "angel": "VEULIAH", "meaning": "Prosperity", "purpose": "For the destruction of the enemy and deliverance from bondage. Love glory and the military."},
  {"degrees": "216°-220°", "angel_number": 44, "angel": "YELAHIAH", "meaning": "Karmic Warrior", "purpose": "Success of a useful undertaking. Protection against magistrates. Trials. Protects against armies, gives victory. Fond of travel and learning. All his undertakings are crowned with success; distinguished for military capabilities and courage."},
  {"degrees": "221°-225°", "angel_number": 45, "angel": "SEHALIAH", "meaning": "Motivation and Wilfulness", "purpose": "To confound the wicked and the proud, to exalt the humiliated and the fallen. Governs Vegetation. Loves learning, much aptitude."},
  {"degrees": "226°-230°", "angel_number": 46, "angel": "ARIEL", "meaning": "Perceiver and Revealer", "purpose": "To procure revelations. To thank God for the good he sends us. Discovers hidden treasure, reveals the greatest secrets of nature, causes the object of one's desire to be seen in dreams. Strong subtle mind, new and sublime thoughts, discreet, circumspect."},
  {"degrees": "231°-235°", "angel_number": 47, "angel": "ASALIAH", "meaning": "Contemplation", "purpose": "For the praising of God and the growing towards him when he enlightens us. Governs justice, makes the truth known in legal proceedings. Agreeable character, avid for the acquisition of secret knowledge."},
  {"degrees": "236°-240°", "angel_number": 48, "angel": "MIHAEL", "meaning": "Fertility, Fruitfulness", "purpose": "For the preservation of peace and the union of man and wife. Protects those who address themselves to him, gives premonitions and secret inspirations. Governs generation of beings. Avid for love, fond of walks and pleasures in general."},
  {"degrees": "241°-245°", "angel_number": 49, "angel": "VEHUEL", "meaning": "Elevation, Grandeur", "purpose": "Sorrow, contrariness. For the exaltation of oneself for the benediction and glory of God. Sensitive and generous soul. Literature, jurisprudence, diplomacy."},
  {"degrees": "246°-250°", "angel_number": 50, "angel": "DANIEL", "meaning": "Eloquence", "purpose": "To obtain the mercy of God and consolation. Governs justice, lawyers, solicitors. Furnishes conclusions to those who hesitate. Industrious and active in business. Loves literature and is distinguished for eloquence."},
  {"degrees": "251°-255°", "angel_number": 51, "angel": "HAHASIAH", "meaning": "Universal Medicine", "purpose": "For the elevation of the soul and the discovery of the mysteries of wisdom. Governs chemistry and physics. Reveals the secret of the Philosopher's Stone and universal medicine. Loves abstract science. Devoted to the discovery of the properties of animals, plants and minerals. Distinguished in medicine."},
  {"degrees": "256°-260°", "angel_number": 52, "angel": "IMAMIAH", "meaning": "Expiation of Errors", "purpose": "Destroys the power of enemies and humbles them. Governs voyages in general, protects prisoners who turn to him and gives them the means of obtaining their freedom. Forceful, vigorous temperament, bears adversity with patience and courage. Fond of work."},
  {"degrees": "261°-265°", "angel_number": 53, "angel": "NANAEL", "meaning": "Spiritual Communication", "purpose": "Governs the high sciences. Melancholy humor, avoids rest, meditation, well-versed in the abstract sciences."},
  {"degrees": "266°-270°", "angel_number": 54, "angel": "NITHAEL", "meaning": "Rejuvenation and Eternal Youth", "purpose": "To obtain consolation in adversity and for the acquisition of wisdom. Influences occult science. Makes the truth known to those who call on him in their work. Enlightened requirements of the spirit of God. Fond of solitude, distinguished in higher sciences."},
  {"degrees": "271°-275°", "angel_number": 55, "angel": "MEBAHIAH", "meaning": "Intellectual Lucidity", "purpose": "Beneficial for obtaining consolation and compensations. Governs morality and religion. Distinguished by good deeds and piety."},
  {"degrees": "276°-280°", "angel_number": 56, "angel": "POYEL", "meaning": "Fortune and Support", "purpose": "For the fulfillment of one's request. Governs renown, fortune and philosophy. Well esteemed by everyone for his modesty and agreeable humor."},
  {"degrees": "281°-285°", "angel_number": 57, "angel": "NEMAMIAH", "meaning": "Discernment", "purpose": "For general prosperity and the deliverance of prisoners. Governs great captains. Drawn to the military; distinguished for activity and the courageous bearing of fatigue."},
  {"degrees": "286°-290°", "angel_number": 58, "angel": "YEIALEL", "meaning": "Mental Force", "purpose": "Protects against sorrow and care and heals the sick, especially afflictions of the eyes. Influences iron and those in commerce. Brave, frank, affinity for Venus."},
  {"degrees": "291°-295°", "angel_number": 59, "angel": "HARAHEL", "meaning": "Intellectual Richness", "purpose": "Against the sterility of women and to make children obedient to their parents. Governs treasure and banks. Printing, books. Love of learning, successful in business."},
  {"degrees": "296°-300°", "angel_number": 60, "angel": "MITZRAEL", "meaning": "Internal Reparation", "purpose": "For the cure of mental illness and deliverance from those who persecute us. Virtuous, longevity."},
  {"degrees": "301°-305°", "angel_number": 61, "angel": "UMABEL", "meaning": "Affinity and Friendship", "purpose": "To obtain the friendship of a given person. Fond of travel and honest pleasures; sensitive heart."},
  {"degrees": "306°-310°", "angel_number": 62, "angel": "IAH-HEL", "meaning": "Desire to Know", "purpose": "For the acquisition of wisdom. Governs philosophers, illuminati. Loves tranquility and solitude, modest, virtuous."},
  {"degrees": "311°-315°", "angel_number": 63, "angel": "ANANUEL", "meaning": "Perception of Unity", "purpose": "For the conversion of nations to Christianity. Protects against accidents, heals the sick. Governs commerce, banking. Subtle and ingenious, industrious and active."},
  {"degrees": "316°-320°", "angel_number": 64, "angel": "MEHIEL", "meaning": "Vivification", "purpose": "Against adversities. Protects against rabies and wild beasts. Governs savants, professors, orators and others. Distinguished in literature."},
  {"degrees": "321°-325°", "angel_number": 65, "angel": "DAMABIAH", "meaning": "Fountain of Wisdom", "purpose": "Against magic spells and for the obtainment of wisdom and the undertaking of successful ventures. Governs seas, rivers, springs, sailors. Sailor; amasses a considerable fortune."},
  {"degrees": "326°-330°", "angel_number": 66, "angel": "MANAKEL", "meaning": "Knowledge of Good and Evil", "purpose": "For the appeasement of the anger of God and for the healing of epilepsy. Governs vegetation, aquatic animals. Influences dreams. Gentleness of character."},
  {"degrees": "331°-335°", "angel_number": 67, "angel": "ITAIEL", "meaning": "Transformation to the Sublime", "purpose": "To obtain consolation in adversity and for the acquisition of wisdom. Influences occult science. Makes the truth known to those who call on him in their work. Enlightened requirements of the spirit of God. Fond of solitude, distinguished in higher sciences."},
  {"degrees": "336°-340°", "angel_number": 68, "angel": "CHABUIAH", "meaning": "Healing", "purpose": "For the preservation of health and the healing of the sick. Governs agriculture and fecundity. Fond of the countryside, hunting, gardens and all that is related to agriculture."},
  {"degrees": "341°-345°", "angel_number": 69, "angel": "ROCHEL", "meaning": "Restitution", "purpose": "To find lost or stolen objects and discover the person responsible. Distinguished in the judiciary, morals and customs of all peoples."},
  {"degrees": "346°-350°", "angel_number": 70, "angel": "HABUHIAH", "meaning": "Alchemy/Transformation", "purpose": "Governs the generation of beings and phenomena of nature. Protects those who wish to progress spiritually. Distinguished by genius; one of the great lights of philosophy."},
  {"degrees": "351°-355°", "angel_number": 71, "angel": "HAIYAEL", "meaning": "Divine Warrior/Weaponry", "purpose": "To confound the wicked and for deliverance from those who seek to oppress us. Protects those who call upon him. Influences fire. Brave."},
  {"degrees": "356°-360°", "angel_number": 72, "angel": "MUMIAH", "meaning": "Endings and Rebirth", "purpose": "A divine talisman should be prepared under favorable influences with the name of the spirit on the reverse side. Protects in mysterious operations, brings success in all things. Governs chemistry, physics and medicine. Influences health and longevity."}
]
